app/controllers/cars_controller.rb

SELECT "cars".* FROM "cars"
---
  def index
    @cars = Car.all

INSERT INTO "cars" ("make", "model", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["make", "Honda"], ["model", "City"], ["year", 2019], ["created_at", "2020-08-03 22:44:22.011352"], ["updated_at", "2020-08-03 22:44:22.011352"]]
---
  def create
    @car = Car.new(car_params)

    respond_to do |format|
      if @car.save

SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_car
      @car = Car.find(params[:id])